# Homework 6: Modifying the Configuration of a Table and SELECT statements

This is an **individual** assignment. Total: 20 points. Due:**<span style="color:red">  Sunday, October 22, 10:00 pm </span>**.

#### Task 1: 
Write a SQL statement to create a table named `libraries` with a primary key `library_id`. The table also includes the following columns: `library_name` (text data type), and `address` (text data type).

```sql
CREATE TABLE libraries (
	library_id INT PRIMARY KEY AUTO_INCREMENT,
    library_name TEXT,
    address TEXT
);
```

#### Task 2:
Alter the `libraries` table to add a new column named `phone_number` with a data type of VARCHAR(15).

```sql
ALTER TABLE libraries
ADD phone_number VARCHAR(15);
```

#### Task 3:
Write an SQL statement to modify the `phone_number` column in the `libraries` table to change its data type to VARCHAR(20).

```sql
ALTER TABLE libraries
MODIFY phone_number VARCHAR(20);
```

#### Task 4:
Modify the `library_name` column in the `libraries` table to add a NOT NULL constraint.

```sql
ALTER TABLE libraries
MODIFY library_name TEXT NOT NULL;
```

#### Task 5:
Write an SQL statement to alter the `library_name` column again to remove the NOT NULL constraint.

```sql
ALTER TABLE libraries
MODIFY library_name TEXT;
```

#### Task 6:
Alter the `libraries` table to add a UNIQUE constraint to the `phone_number` column.

```sql
ALTER TABLE libraries
ADD UNIQUE (phone_number);
```

#### Task 7:
Write an SQL statement to remove the UNIQUE constraint from the `phone_number` column in the `libraries` table.

```sql
SHOW INDEX FROM libraries;

ALTER TABLE libraries
DROP INDEX phone_number;
```

#### Task 8:
Alter the `libraries` table, setting a DEFAULT value for the `address` column as `'Unknown'`.

```sql
ALTER TABLE libraries
MODIFY address VARCHAR(20)

ALTER TABLE libraries
ALTER COLUMN address SET DEFAULT 'UNKNOWN';
```

#### Task 9:
Write an SQL statement to remove the DEFAULT constraint from the `address` column in the `libraries` table.

```sql
ALTER TABLE libraries
ALTER COLUMN address DROP DEFAULT;
```

#### Task 10:
Write an SQL statement to drop the `phone_number` column from the `libraries` table.

```sql
ALTER TABLE libraries
DROP COLUMN phone_number;
```

For each of these exercises, after performing the operations, use the `DESCRIBE`statement to view the structure of the table and verify the changes:
```sql
DESC libraries;
```
Practicing these exercises will help solidify your understanding of manipulating table structures using SQL and give you a practical understanding of the effects these operations have on your data and schema.

---

<i> Note: The next exercises assume you have a database with a table named `employees` that has various columns like `id`, `name`, `department`, `salary`, `position`, `email`, `hire_date`, etc.</i>

#### Task 11:
Write a query to select the `name` and `email` columns from the `employees` table.

```sql
SELECT name, email FROM employees;
```

#### Task 12:
Write a query to find all the unique department entries in the `employees` table.

```sql
SELECT DISTINCT department FROM employees;
```

#### Task 13:
Write a query to retrieve all information (*) for employees in the `Finance` department.

```sql
SELECT * FROM employees Finance;
```

#### Task 14:
Write a query to select all employees' `names` and `salaries` and order the results by `salary` in `descending order`.

```sql
SELECT name, salary FROM employees
ORDER BY salary DESC;
```

#### Task 15:
Write a query to select the `top 5` employees with the `highest salaries`.

```sql
SELECT * FROM employees
ORDER BY salary DESC
LIMIT 5;
```

#### Task 16:
Write a query to find the `average salary` of all employees.

```sql
SELECT AVG(salary) AS AvgSal FROM employees;
```

#### Task 17:
Write a query to count the number of employees in each `department`.

```sql
SELECT department, COUNT(*) 
AS DepCounts FROM employees
GROUP BY department;
```

#### Task 18:
Write a query to find departments with `more than 10 employees`.

```sql
SELECT COUNT(department) FROM employees
WHERE department > 10;
```

#### Task 19:
Write a query to find employees hired in the `year 2020`.

```sql
SELECT YEAR('2020') FROM employees;
```

#### Task 20 (Assuming you have another table departments with columns id and department_name):
Write a query to select all employees along with their `department names`, not department IDs.

```sql
SELECT employees.*, departments.department_name FROM employees
INNER JOIN departments;
```

These exercises are progressively structured to cover the basics to more complex uses of the SELECT statement. Solving them will provide a good grasp of how to query data from a MySQL database.